n5/src/Catalogs/Assistants/Assistants.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Assistants</name>
  <attributes>
    <name>CodeInterpreter</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Model</name>
    <type>
      <types>CatalogRef.AIModels</types>
    </type>
  </attributes>
  <attributes>
    <name>Provider</name>
    <type>
      <types>EnumRef.AIProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>Purpose</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Retrieval</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Search</name>
    <type>
      <types>EnumRef.InternetSearch</types>
    </type>
  </attributes>
  <attributes>
    <name>Server</name>
    <type>
      <types>CatalogRef.Servers</types>
    </type>
  </attributes>
  <attributes>
    <name>Temperature</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Files</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Login</name>
      <type>
        <types>CatalogRef.Logins</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Instructions</name>
    <attributes>
      <name>Instruction</name>
      <type>
        <types>CatalogRef.Instructions</types>
      </type>
    </attributes>
    <attributes>
      <name>System</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/InformationRegisters/AIFiles/AIFiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AIFiles</name>
  <resources>
    <name>Created</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Extension</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FileSize</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Hash</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Size</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Login</name>
    <type>
      <types>CatalogRef.Logins</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Server</name>
    <type>
      <types>CatalogRef.Servers</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/Files/Files.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Files</name>
  <resources>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Extension</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Size</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.Document</types>
      <types>DocumentRef.DocumentVersion</types>
    </type>
  </dimensions>
  <dimensions>
    <name>File</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Enums/AIProviders/AIProviders.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AIProviders</name>
  <enumValues>
    <name>OpenAI</name>
  </enumValues>
  <enumValues>
    <name>Anthropic</name>
  </enumValues>
</mdclass:Enum>

n5/src/Documents/Document/Document.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Document</name>
  <posting>Deny</posting>
  <attributes>
    <name>AttachmentsContent</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Book</name>
    <type>
      <types>CatalogRef.Books</types>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Data</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>FolderID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsEmpty</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Link</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Object</name>
    <type>
      <types>DefinedType.DocumentObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>SpecialAccess</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Table</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Versioning</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Changes</name>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>600</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ComputerName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>Version</name>
      <type>
        <types>DocumentRef.Document</types>
        <types>DocumentRef.DocumentVersion</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/Catalogs/Assistants/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )

	filterFiles ();
	setFilter ();
	readID ();
	Appearance.Apply ( ThisObject );

EndProcedure

&AtServer
Procedure filterFiles ()
	
	DC.SetParameter ( Files, "Server", Object.Server );
	ids = new Array ();
	creators = new Array ();
	for each row in Object.Files do
		ids.Add ( row.ID );
		creators.Add ( row.Login );
	enddo;
	DC.SetParameter ( Files, "Logins", creators );
	DC.SetParameter ( Files, "IDs", ids );
	
EndProcedure

&AtServer
Procedure setFilter ()

	tenants = new Array ();
	tenants.Add ( Catalogs.Tenants.EmptyRef () );
	if ( not Object.Tenant.IsEmpty () ) then
		tenants.Add ( Object.Tenant );
	endif;
	list = new Array ();
	list.Add ( new ChoiceParameter ( "Filter.Tenant", new FixedArray ( tenants ) ) );
	Items.InstructionsInstruction.ChoiceParameters = new FixedArray ( list );

EndProcedure

&AtServer
Procedure readID ()
	
	obj = FormAttributeToValue ( "Assistant" );
	obj.Assistant = Object.Ref;
	obj.Read ();
	ValueToFormAttribute ( obj, "Assistant" );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	init ();
	if ( Object.Ref.IsEmpty () ) then
		fillNew ();
		filterFiles ();
		setFilter ();
	endif; 
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure init ()
	
	Sysadmin = Logins.Sysadmin ();
	Login = SessionParameters.Login;
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|FormReDeploy show filled ( Object.Ref );
	|DeployWarning show not ( Assistant.Synced or Object.DeletionMark ) and filled ( Assistant.ID );
	|RemovedWarning show not Assistant.Synced and Object.DeletionMark and filled ( Assistant.ID )
	|	and Object.Provider = Enum.AIProviders.OpenAI;
	|AssistantID show filled ( Assistant.ID );
	|Tenant lock filled ( Assistant.ID ) or not Sysadmin;
	|CodeInterpreter Retrieval Attach AttachDocument Delete Upload Files
	|	show Object.Provider = Enum.AIProviders.OpenAI;
	|Provider lock filled ( Object.Ref );
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()

	if ( Logins.Sysadmin () ) then
		Object.Tenant = undefined;
	else
		Object.Tenant = SessionParameters.Tenant;
	endif;
	
EndProcedure

&AtClient
Procedure BeforeWrite ( Cancel, WriteParameters )
	
	if ( Deploying ) then
		return;
	endif;
	if ( not CheckFilling () ) then
		Cancel = true;
		return;
	endif;
	if ( not Assistant.Synced ) then
		Cancel = true;
		deploy ();
	endif;
	
EndProcedure

&AtClient
Procedure deploy ()
	
	Deploying = true;
	if ( Modified ) then
		Write ();
	endif;
	if ( Object.DeletionMark and
		Object.Provider = PredefinedValue ( "Enum.AIProviders.Anthropic" ) ) then
		return;
	endif;
	run ( Object.Ref, Object.DeletionMark, JobKey );
	Progress.Open ( JobKey, ThisObject, new CallbackDescription ( "DeploymentComplete", ThisObject ), true );
	
EndProcedure

&AtServerNoContext
Procedure run ( val Ref, val DeletionMark, val JobKey )
	
	args = new Array ();
	if ( DeletionMark ) then
		p = AIServer.DeleteAssistantParams ();
		job = "AIServer.DeleteAssistant";
	else
		p = AIServer.DeployAssistantParams ();
		job = "AIServer.DeployAssistant";
	endif;
	p.Assistant = Ref;
	args.Add ( p );
	Jobs.Run ( job, args, JobKey, , TesterCache.Testing () );
	
EndProcedure

&AtClient
Procedure DeploymentComplete ( Result, Params ) export
	
	Deploying = false;
	readID ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	if ( not Assistant.Synced ) then
		Catalogs.Assistants.Unsync ( Object.Ref );
	endif;
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer ( CurrentObject, WriteParameters )
	
	Appearance.Apply ( ThisObject );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure FieldOnChange ( Item )

	dirty ( ThisObject );

EndProcedure

&AtClientAtServerNoContext
Procedure dirty ( Form )
	
	Form.Assistant.Synced = false;
	Appearance.Apply ( Form, "Assistant.Synced" );
	
EndProcedure

&AtClient
Procedure InstructionsInstructionOnChange ( Item )
	
	dirty ( ThisObject );
	
EndProcedure

&AtClient
Procedure ReDeploy ( Command )

	dirty ( ThisObject );
	Write ();

EndProcedure

&AtClient
Procedure ProviderOnChange ( Item )
	
	applyProvider ();
	
EndProcedure

&AtClient
Procedure applyProvider ()
	
	if ( Object.Provider = PredefinedValue ( "Enum.AIProviders.Anthropic" ) ) then
		Object.CodeInterpreter = false;
		Object.Retrieval = false;
	endif;
	AssistantsForm.AdjustTemperature ( ThisObject, true );
	dirty ( ThisObject );
	Appearance.Apply ( ThisObject, "Object.Provider" );
	
EndProcedure

// *****************************************
// *********** Table Instructions

&AtClient
Procedure TenantOnChange ( Item )
	
	applyTenant ();
	
EndProcedure

&AtServer
Procedure applyTenant ()

	cleanInstructions ();
	setFilter ();
	dirty ( ThisObject );

EndProcedure

&AtServer
Procedure cleanInstructions ()

	for each row in Object.Instructions do
		row.Instruction = undefined;
	enddo;

EndProcedure

// *****************************************
// *********** Table Files

&AtClient
Procedure Attach ( Command )
	
	if ( not CheckFilling () ) then
		return;
	endif;
	pickFiles ();
	
EndProcedure

&AtClient
Procedure pickFiles ()
	
	OpenForm ( "InformationRegister.AIFiles.ListForm",
		new Structure ( "Filter, ChoiceMode", new Structure ( "Server", Object.Server ), true ),
		Items.Files,,,,, FormWindowOpeningMode.LockOwnerWindow );
	
EndProcedure

&AtClient
async Procedure Upload ( Command )
	
	if ( not CheckFilling () ) then
		return;
	endif;
	set = await prepareFiles ();
	if ( set = undefined ) then
		return;
	endif;
	uploadData ( set, true );

EndProcedure

&AtClient
Procedure uploadData ( List, FromFiles )

	JobKey = "Uploading " + UUID;
	if ( FromFiles ) then
		transferFiles ( List );
	else
		transferDocuments ( List );
	endif;
	Progress.Open ( JobKey, ThisObject, new CallbackDescription ( "CompleteUploading", ThisObject ), true );

EndProcedure

&AtClient
async Function prepareFiles ()

	list = await PutFilesToServerAsync ( , , new PutFilesDialogParameters ( , true ) );
	if ( list = undefined ) then
		return undefined;
	endif;
	set = Attachments.GetStoredFiles ( list );
	return ? ( set.Count () = 0, undefined, set );

EndFunction

&AtServer
Procedure transferFiles ( val Files )
	
	list = new Array ();
	for each file in Files do
		descriptor = AIServer.FileDescriptor (
			file.Name,
			file.Size,
			GetFromTempStorage ( file.Address )
		);
		list.Add ( descriptor );
	enddo;
	startUploadingJob ( list );
	
EndProcedure

&AtServer
Procedure startUploadingJob ( Files )

	p = AIServer.UploadFilesParams ();
	p.Files = Files;
	ResultAddress = PutToTempStorage ( undefined, UUID );
	p.Result = ResultAddress;
	p.Server = Object.Server;
	args = new Array ();
	args.Add ( p );
	Jobs.Run ( "AIServer.UploadFiles", args, JobKey, , TesterCache.Testing () );

EndProcedure

&AtServer
Procedure transferDocuments ( val List )
	
	s = "
	|select Files.Document.FolderID as Folder, Files.File as Name, Files.Size as Size
	|from InformationRegister.Files as Files
	|where Files.Document in ( &Documents )
	|";
	q = new Query ( s );
	q.SetParameter ( "Documents", List );
	table = q.Execute ().Unload ();
	separator = GetPathSeparator ();
	set = new Array ();
	for each row in table do
		name = row.Name;
		file = CKEditorSrv.GetFolder ( row.Folder ) + separator + name;
		descriptor = AIServer.FileDescriptor (
			name,
			row.Size,
			new BinaryData ( file )
		);
		set.Add ( descriptor );
	enddo;
	startUploadingJob ( set );
	
EndProcedure

&AtClient
Procedure CompleteUploading ( Result, Params ) export
	
	if ( not Result ) then
		return;
	endif;
	data = GetFromTempStorage ( ResultAddress );
	if ( data = undefined ) then
		return;
	endif;
	isDirty = false;
	for each file in data.Files do
		error = file.Error;
		if ( error = "" ) then
			addFile ( file.ID );
			isDirty = true;
		else
			Output.Error ( new Structure ( "Error", file.File.Name + ": " + error ) );
		endif;
	enddo;
	if ( isDirty ) then
		dirty ( ThisObject );
		filterFiles ();
		Items.Files.Refresh ();
	endif;
	
EndProcedure

&AtClient
Procedure addFile ( ID )

	row = Object.Files.Add ();
	row.Login = Login;
	row.ID = ID;
	
EndProcedure

&AtClient
Procedure AttachDocument ( Command )

	if ( not CheckFilling () ) then
		return;
	endif;
	pickDocuments ();

EndProcedure
	
&AtClient
Procedure pickDocuments ()

	OpenForm ( "Document.Document.ChoiceForm",
		new Structure ( "MultipleChoice", true ),
		Items.Files,,,,,
		FormWindowOpeningMode.LockOwnerWindow );

EndProcedure

&AtClient
Procedure FilesChoiceProcessing ( Item, Set, StandardProcessing )

	StandardProcessing = false;
	if ( TypeOf ( Set [ 0 ] ) = Type ( "DocumentRef.Document" ) ) then
		uploadData ( Set, false );
	else
		loadFiles ( Set );
	endif;

EndProcedure

&AtClient
Procedure loadFiles ( List )

	if ( List.Count () = 0 ) then
		return;
	endif;
	for each file in List do
		addFile ( file.ID );
	enddo;
	dirty ( ThisObject );
	filterFiles ();
	Items.Files.Refresh ();

EndProcedure

&AtClient
Procedure Delete ( Command )

	row = Items.Files.CurrentData;
	if ( row = undefined ) then
		return;
	endif;
	table = Object.Files;
	rows = table.FindRows ( new Structure ( "Login, ID", Login, row.ID ) );
	table.Delete ( rows [ 0 ] );
	dirty ( ThisObject );
	filterFiles ();
	Items.Files.Refresh ();

EndProcedure
